app/controllers/contact_form_controller.rb

INSERT INTO `contact_forms` (`first_name`, `last_name`, `email`, `message`, `created_at`, `updated_at`) VALUES ('sharat', 'hegde', 'jhg@gmail.com', 'ss', '2021-08-14 04:59:04', '2021-08-14 04:59:04')
---
    def save_contact
      begin
        contact = params["contact"]
        if (contact["first_name"].blank? || contact["last_name"].blank? || contact["email"].blank?)
          flash[:error] = "Please fill mandatory fields"
        end

        if flash[:error].blank?
          contact_obj = ContactForm.new(first_name: contact["first_name"], last_name: contact["last_name"], email: contact["email"], message: contact["message"])
          contact_obj.save()